sdaiGetComplexEntity(Sdai_Id_aggr*)
\details
Complex instance will be created within parent schema if such combination doesn't exist.
\param entityList   [in] List of members of complex entities.
\returns valid SdaiEntity if succeeded, otherwise returns nullptr.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiRP_NOPN - Repository is not open.
* sdaiSD_NDEF - Schema definition not defined.
* sdaiED_NDEF - Entity definition not defined.
* sdaiED_NVLD - Entity definition invalid.
* sdaiFN_NAVL - Function not available.
* sdaiSY_ERR - Underlying system error.
\code
SdaiNPL entityList = sdaiCreateNPL();
auto namedUnitEntity = sdaiGetEntity(model, "odanamedunit");
sdaiPutAggrByIndex(entityList, 0, sdaiINSTANCE, namedUnitEntity);
auto siUnitEntity = sdaiGetEntity(model, "odasiunit");
sdaiPutAggrByIndex(entityList, 1, sdaiINSTANCE, siUnitEntity);
SdaiEntity complexEntity = sdaiGetComplexEntity(entityList);